src/Documents/ПриемНаРаботу/ПриемНаРаботу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриемНаРаботу</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контракт</name>
    <type>
      <types>CatalogRef.ВидыКонтрактов</types>
    </type>
  </attributes>
  <attributes>
    <name>Принял</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Приняли</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
  </tabularSections>
</mdclass:Document>

src/Documents/ПриемНаРаботу/ObjectModule.bsl
&НаСервере
Процедура ОбработкаПроведения()
    Для Каждого Строка Из Сотрудники Цикл
        Принял = Строка.Сотрудник.ПолучитьОбъект();
        Принял.ДатаНачалаИС = Дата;  // Дата документа
        
        // Расчет даты окончания ИС
        Если Контракт.ИспытательныйСрок > 0 Тогда
            Принял.ДатаКонцаИС = Дата + Контракт.ИспытательныйСрок;
        Иначе
            // Если испытательного срока нет
            Принял.ДатаКонцаИС = '00010101'; // Минимальная дата
        КонецЕсли;
        
        Принял.РезультатИС = ""; // Сброс результата
        Принял.Записать();
    КонецЦикла;
КонецПроцедуры
